/*
 * 概要：マイコンカーの機能についての設定を行う
 */
#pragma once
#include <Arduino.h>

/******************************************************************/
/* ラインセンサーの種類選択                                         */
/******************************************************************/
// デジタルセンサ5個、アナログセンサ2個のセンサ構成
#define CONFIG_LINE_SENSOR_D5A2
// オールアナログステルスセンサの構成
// #define CONFIG_LINE_SENSOR_STEALTH

/******************************************************************/
/* モーター極性                                                    */
/******************************************************************/
// モーターの回転を逆にしたい場合に有効にする
#define CONFIG_MOTOR_FL_INVERT ( 0 )
#define CONFIG_MOTOR_FR_INVERT ( 0 )
#define CONFIG_MOTOR_RL_INVERT ( 0 )
#define CONFIG_MOTOR_RR_INVERT ( 0 )
#define CONFIG_MOTOR_SV_INVERT ( 1 )

/******************************************************************/
/* デバッグモード                                                  */
/******************************************************************/
// デバッグ用の出力
#define CONFIG_MCR_APP_DEBUG ( 0 )

// screenのフレームレート表示
#define CONFIG_SCREEN_FPS ( 1 )

/******************************************************************/
/* シリアル通信によるテストモード有効                                */
/******************************************************************/
#define CONFIG_COMMAND_TEST_MODE ( 0 )